
## :x: Apply Failed

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/7688552225)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Running apply in the remote backend. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/tfc-mongulu-cm/mtchoun-mouh-lambda-layer/runs/run-Qzxp6BHG3W5cd1hY

Waiting for the plan to start...

Terraform v1.5.4
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=b464fb8901f09f6f02604a785b169e329ec86e39]
data.aws_iam_role.role: Reading...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=053932140667]
data.aws_iam_role.role: Read complete after 0s [id=website-deployer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_deployment.test will be created
  + resource "aws_api_gateway_deployment" "test" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "mtchoun-mouh-lambda-layer-dev"
    }

  # aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.method will be created
  + resource "aws_api_gateway_method" "method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_method_response.method_response_200 will be created
  + resource "aws_api_gateway_method_response" "method_response_200" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = false
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # aws_api_gateway_resource.resource will be created
  + resource "aws_api_gateway_resource" "resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "register"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.api will be created
  + resource "aws_api_gateway_rest_api" "api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "Allow to register user for sending notifications later"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = -1
      + name                         = "mtchoun-mouh-lambda-layer-user registration"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags                         = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all                     = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }

      + endpoint_configuration {
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_cloudwatch_event_rule.scheduler will be created
  + resource "aws_cloudwatch_event_rule" "scheduler" {
      + arn                 = (known after apply)
      + description         = "extract image - verify passport is out - send notifications"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "mtchoun-mouh-lambda-layer-trigger_user_scan"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 8 ? * MON-FRI *)"
      + tags                = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all            = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
    }

  # aws_cloudwatch_event_target.target will be created
  + resource "aws_cloudwatch_event_target" "target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "mtchoun-mouh-lambda-layer-trigger_user_scan"
      + target_id      = "lambda"
    }

  # aws_dynamodb_table.Link_table will be created
  + resource "aws_dynamodb_table" "Link_table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "link"
      + id               = (known after apply)
      + name             = "mtchoun-mouh-lambda-layer-Link_table"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all         = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + write_capacity   = 1

      + attribute {
          + name = "link"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }
    }

  # aws_dynamodb_table.Register will be created
  + resource "aws_dynamodb_table" "Register" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "Name"
      + id               = (known after apply)
      + name             = "mtchoun-mouh-lambda-layer-Register"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all         = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + write_capacity   = 1

      + attribute {
          + name = "Name"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }
    }

  # aws_dynamodb_table.Users will be created
  + resource "aws_dynamodb_table" "Users" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "UserName"
      + id               = (known after apply)
      + name             = "mtchoun-mouh-lambda-layer-Users"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all         = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + write_capacity   = 1

      + attribute {
          + name = "UserName"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }
    }

  # aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + arn                            = (known after apply)
      + filename                       = "api/lambda.zip"
      + function_name                  = "mtchoun-mouh-lambda-layer-user_registration_consulcam"
      + handler                        = "lambda.register_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::053932140667:role/website-deployer"
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "sdXkkIUn6SqwHkfapeP2yXoDz63SXDjjp7umyRdXzaU="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all                       = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_KEY"         = (sensitive value)
              + "BUCKET_NAME"     = "mtchoun-mouh-lambda-layer-djansang"
              + "ENV"             = "mtchoun-mouh-lambda-layer"
              + "LINKS_TABLE"     = "mtchoun-mouh-lambda-layer-Link_table"
              + "MAINTAINER_MAIL" = (sensitive value)
              + "REGION"          = "eu-central-1"
              + "REGISTERS_TABLE" = "mtchoun-mouh-lambda-layer-Register"
              + "SENTRY_DNS"      = (sensitive value)
              + "USERS_TABLE"     = "mtchoun-mouh-lambda-layer-Users"
            }
        }
    }

  # aws_lambda_function.scan will be created
  + resource "aws_lambda_function" "scan" {
      + arn                            = (known after apply)
      + filename                       = "api/lambda.zip"
      + function_name                  = "mtchoun-mouh-lambda-layer-scan_user_consulcam"
      + handler                        = "lambda.scan_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::053932140667:role/website-deployer"
      + runtime                        = "python3.8"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "sdXkkIUn6SqwHkfapeP2yXoDz63SXDjjp7umyRdXzaU="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all                       = {
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "API_KEY"         = (sensitive value)
              + "BUCKET_NAME"     = "mtchoun-mouh-lambda-layer-djansang"
              + "ENV"             = "mtchoun-mouh-lambda-layer"
              + "LINKS_TABLE"     = "mtchoun-mouh-lambda-layer-Link_table"
              + "MAINTAINER_MAIL" = (sensitive value)
              + "REGION"          = "eu-central-1"
              + "REGISTERS_TABLE" = "mtchoun-mouh-lambda-layer-Register"
              + "SENTRY_DNS"      = (sensitive value)
              + "USERS_TABLE"     = "mtchoun-mouh-lambda-layer-Users"
            }
        }
    }

  # aws_lambda_layer_version.test_lambda_layer will be created
  + resource "aws_lambda_layer_version" "test_lambda_layer" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.7",
          + "python3.8",
        ]
      + created_date                = (known after apply)
      + filename                    = "python.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "test_lambda_layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_lambda_permission.allow_cloudwatch_to_call_check_foo will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_call_check_foo" {
      + action        = "lambda:InvokeFunction"
      + function_name = "mtchoun-mouh-lambda-layer-scan_user_consulcam"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

  # aws_lambda_permission.apigw_lambda will be created
  + resource "aws_lambda_permission" "apigw_lambda" {
      + action        = "lambda:InvokeFunction"
      + function_name = "mtchoun-mouh-lambda-layer-user_registration_consulcam"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromAPIGateway"
    }

  # aws_s3_bucket.images will be created
  + resource "aws_s3_bucket" "images" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "mtchoun-mouh-lambda-layer-djansang"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"        = "images"
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all                    = {
          + "Name"        = "images"
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket.website will be created
  + resource "aws_s3_bucket" "website" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"        = "Website"
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + tags_all                    = {
          + "Name"        = "Website"
          + "environment" = "mtchoun-mouh-master"
          + "project"     = "mtchoun-mouh"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "PUT",
              + "POST",
              + "GET",
            ]
          + allowed_origins = [
              + "*",
            ]
        }

      + website {
          + error_document = "error.html"
          + index_document = "index.html"
        }
    }

  # aws_s3_bucket_object.example_file will be created
  + resource "aws_s3_bucket_object" "example_file" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../html/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_bucket_policy.website will be created
  + resource "aws_s3_bucket_policy" "website" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.website will be created
  + resource "aws_s3_bucket_public_access_block" "website" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

  # null_resource.lambda_layer will be created
  + resource "null_resource" "lambda_layer" {
      + id = (known after apply)
    }

  # module.cors.aws_api_gateway_integration._ will be created
  + resource "aws_api_gateway_integration" "_" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + content_handling     = "CONVERT_TO_TEXT"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = (known after apply)
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.cors.aws_api_gateway_integration_response._ will be created
  + resource "aws_api_gateway_integration_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Authorization,Content-Type,X-Amz-Date,X-Amz-Security-Token,X-Api-Key'"
          + "method.response.header.Access-Control-Allow-Methods" = "'OPTIONS,HEAD,GET,POST,PUT,PATCH,DELETE'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
          + "method.response.header.Access-Control-Max-Age"       = "'7200'"
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.cors.aws_api_gateway_method._ will be created
  + resource "aws_api_gateway_method" "_" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.cors.aws_api_gateway_method_response._ will be created
  + resource "aws_api_gateway_method_response" "_" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
          + "method.response.header.Access-Control-Max-Age"       = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

Plan: 27 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + register_table = "mtchoun-mouh-lambda-layer-Register"
  + stage_url      = (known after apply)
  + website_url    = (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 5 estimated
           $1.74096/mo +$1.74096

------------------------------------------------------------------------

null_resource.lambda_layer: Creating...
null_resource.lambda_layer: Provisioning with 'local-exec'...
null_resource.lambda_layer (local-exec): Executing: ["/bin/sh" "-c" "        /bin/bash\n\n        pip install virtualenv &&\\\n        virtualenv --python=/usr/bin/python3.8 python &&\\\n        source python/bin/activate &&\\\n        pip install -r api/requirements.txt -t python/lib/python3.8/site-packages &&\\\n        ls python &&\\\n        wget https://mongulu-files.s3.eu-central-1.amazonaws.com/7zz && chmod u+x 7zz &&\\\n        ./7zz a python.zip python/ &&\\\n        ./7zz l python.zip\n"]
aws_cloudwatch_event_rule.scheduler: Creating...
aws_lambda_layer_version.test_lambda_layer: Creating...
aws_api_gateway_rest_api.api: Creating...
aws_dynamodb_table.Link_table: Creating...
aws_dynamodb_table.Register: Creating...
aws_dynamodb_table.Users: Creating...
aws_lambda_function.scan: Creating...
aws_s3_bucket.images: Creating...
aws_s3_bucket.website: Creating...
null_resource.lambda_layer (local-exec): Collecting virtualenv
null_resource.lambda_layer (local-exec):   Downloading virtualenv-20.25.0-py3-none-any.whl (3.8 MB)
aws_cloudwatch_event_rule.scheduler: Creation complete after 1s [id=mtchoun-mouh-lambda-layer-trigger_user_scan]
null_resource.lambda_layer (local-exec): Collecting distlib<1,>=0.3.7
null_resource.lambda_layer (local-exec):   Downloading distlib-0.3.8-py2.py3-none-any.whl (468 kB)
null_resource.lambda_layer (local-exec): Collecting platformdirs<5,>=3.9.1
null_resource.lambda_layer (local-exec):   Downloading platformdirs-4.1.0-py3-none-any.whl (17 kB)
null_resource.lambda_layer (local-exec): Collecting filelock<4,>=3.12.2
null_resource.lambda_layer (local-exec):   Downloading filelock-3.13.1-py3-none-any.whl (11 kB)
null_resource.lambda_layer (local-exec): Installing collected packages: distlib, platformdirs, filelock, virtualenv
aws_api_gateway_rest_api.api: Creation complete after 1s [id=gcnh0hqo2g]
aws_api_gateway_resource.resource: Creating...
null_resource.lambda_layer (local-exec): Successfully installed distlib-0.3.8 filelock-3.13.1 platformdirs-4.1.0 virtualenv-20.25.0
aws_api_gateway_resource.resource: Creation complete after 1s [id=mg4ip3]
module.cors.aws_api_gateway_method._: Creating...
aws_api_gateway_method.method: Creating...
aws_api_gateway_method.method: Creation complete after 0s [id=agm-gcnh0hqo2g-mg4ip3-POST]
aws_api_gateway_method_response.method_response_200: Creating...
module.cors.aws_api_gateway_method._: Creation complete after 0s [id=agm-gcnh0hqo2g-mg4ip3-OPTIONS]
module.cors.aws_api_gateway_method_response._: Creating...
module.cors.aws_api_gateway_integration._: Creating...
aws_api_gateway_method_response.method_response_200: Creation complete after 0s [id=agmr-gcnh0hqo2g-mg4ip3-POST-200]
module.cors.aws_api_gateway_integration._: Creation complete after 1s [id=agi-gcnh0hqo2g-mg4ip3-OPTIONS]
module.cors.aws_api_gateway_method_response._: Creation complete after 1s [id=agmr-gcnh0hqo2g-mg4ip3-OPTIONS-200]
module.cors.aws_api_gateway_integration_response._: Creating...
module.cors.aws_api_gateway_integration_response._: Creation complete after 0s [id=agir-gcnh0hqo2g-mg4ip3-OPTIONS-200]
null_resource.lambda_layer (local-exec): created virtual environment CPython3.8.10.final.0-64 in 1889ms
null_resource.lambda_layer (local-exec):   creator CPython3Posix(dest=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Qzxp6BHG3W5cd1hY/config/python, clear=False, no_vcs_ignore=False, global=False)
null_resource.lambda_layer (local-exec):   seeder FromAppData(download=False, pip=bundle, setuptools=bundle, wheel=bundle, via=copy, app_data_dir=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Qzxp6BHG3W5cd1hY/.local/share/virtualenv)
null_resource.lambda_layer (local-exec):     added seed packages: pip==23.3.1, setuptools==69.0.2, wheel==0.42.0
null_resource.lambda_layer (local-exec):   activators BashActivator,CShellActivator,FishActivator,NushellActivator,PowerShellActivator,PythonActivator
null_resource.lambda_layer (local-exec): /bin/sh: 5: source: not found
aws_dynamodb_table.Users: Creation complete after 6s [id=mtchoun-mouh-lambda-layer-Users]
aws_dynamodb_table.Link_table: Creation complete after 6s [id=mtchoun-mouh-lambda-layer-Link_table]
aws_lambda_function.scan: Creation complete after 7s [id=mtchoun-mouh-lambda-layer-scan_user_consulcam]
aws_lambda_permission.allow_cloudwatch_to_call_check_foo: Creating...
aws_cloudwatch_event_target.target: Creating...
aws_s3_bucket.images: Creation complete after 7s [id=mtchoun-mouh-lambda-layer-djansang]
aws_lambda_permission.allow_cloudwatch_to_call_check_foo: Creation complete after 1s [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.target: Creation complete after 1s [id=mtchoun-mouh-lambda-layer-trigger_user_scan-lambda]
aws_s3_bucket.website: Creation complete after 9s [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
aws_s3_bucket_public_access_block.website: Creating...
aws_dynamodb_table.Register: Still creating... [10s elapsed]
aws_s3_bucket_public_access_block.website: Creation complete after 1s [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
aws_s3_bucket_policy.website: Creating...
aws_dynamodb_table.Register: Creation complete after 10s [id=mtchoun-mouh-lambda-layer-Register]
aws_s3_bucket_policy.website: Creation complete after 0s [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
╷
│ Error: local-exec provisioner error
│ 
│   with null_resource.lambda_layer,
│   on main.tf line 163, in resource "null_resource" "lambda_layer":
│  163:   provisioner "local-exec" {
│ 
│ Error running command '        /bin/bash
│ 
│         pip install virtualenv &&\
│         virtualenv --python=/usr/bin/python3.8 python &&\
│         source python/bin/activate &&\
│         pip install -r api/requirements.txt -t python/lib/python3.8/site-packages &&\
│         ls python &&\
│         wget https://mongulu-files.s3.eu-central-1.amazonaws.com/7zz && chmod u+x 7zz &&\
│         ./7zz a python.zip python/ &&\
│         ./7zz l python.zip
│ ': exit status 127. Output: Collecting virtualenv
│   Downloading virtualenv-20.25.0-py3-none-any.whl (3.8 MB)
│ Collecting distlib<1,>=0.3.7
│   Downloading distlib-0.3.8-py2.py3-none-any.whl (468 kB)
│ Collecting platformdirs<5,>=3.9.1
│   Downloading platformdirs-4.1.0-py3-none-any.whl (17 kB)
│ Collecting filelock<4,>=3.12.2
│   Downloading filelock-3.13.1-py3-none-any.whl (11 kB)
│ Installing collected packages: distlib, platformdirs, filelock, virtualenv
│ Successfully installed distlib-0.3.8 filelock-3.13.1 platformdirs-4.1.0
│ virtualenv-20.25.0
│ created virtual environment CPython3.8.10.final.0-64 in 1889ms
│   creator CPython3Posix(dest=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Qzxp6BHG3W5cd1hY/config/python, clear=False, no_vcs_ignore=False, global=False)
│   seeder FromAppData(download=False, pip=bundle, setuptools=bundle, wheel=bundle, via=copy, app_data_dir=/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Qzxp6BHG3W5cd1hY/.local/share/virtualenv)
│     added seed packages: pip==23.3.1, setuptools==69.0.2, wheel==0.42.0
│   activators BashActivator,CShellActivator,FishActivator,NushellActivator,PowerShellActivator,PythonActivator
│ /bin/sh: 5: source: not found
│ 
╵
╷
│ Error: Unable to load "python.zip": open python.zip: no such file or directory
│ 
│   with aws_lambda_layer_version.test_lambda_layer,
│   on main.tf line 186, in resource "aws_lambda_layer_version" "test_lambda_layer":
│  186: resource "aws_lambda_layer_version" "test_lambda_layer" {
│ 
╵
Operation failed: failed running terraform apply (exit 1)

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":144,"Program":"tfcmt","SHA1":"9e89f3c078d4a95e9d84ee8f605736739bab7c7c","Vars":{},"WorkflowName":"Deploy cases"} -->